Repository: ularutkowska/KCK-Electronic_School_Register
Catalog: KCK-Elektroniczny_Dziennik_Szkolny/Resources/Strings.*.resx
Languages: pl

source: Aborting message
pl: Przerwanie wiadomości

# AddedClassInfo
source: Class has been added
pl: Klasa została dodana

# App_ExitMessage
source: Exiting program...
pl: Zamykanie programu...

# App_Title
source: Electronic School Diary
pl: Elektroniczny Dziennik Szkolny

# ChooseRole
source: Choose a role
pl: Wybierz rolę

source: Class
pl: Klasa

source: Compose Message
pl: Napisz wiadomość

source: Date
pl: Data

source: Enter content
pl: Wprowadź treść

source: Enter email address:
pl: Wprowadź adres e-mail:

source: Enter Password:
pl: Podaj hasło:

source: Enter student ID:
pl: Podaj identyfikator ucznia:

source: Enter subject
pl: Wprowadź temat

# EnterValidOption
source: Enter a valid option (1-3):
pl: Wprowadź poprawną opcję (1-3):

# Error_InvalidDateFormat
source: Invalid date format. Please enter a valid date (yyyy-mm-dd):
pl: Nieprawidłowy format daty. Wprowadź poprawną datę (rrrr-mm-dd):

# Error_InvalidEmail
source: Invalid email address. Please enter a valid email:
pl: Nieprawidłowy adres e-mail. Wprowadź prawidłowy adres e-mail:

# Error_InvalidPhoneNumber
source: Invalid phone number. The phone number must contain at least 9 digits:
pl: Nieprawidłowy numer telefonu. Numer telefonu musi zawierać co najmniej 9 cyfr:

# Error_NotLoggedInAsParent
source: You are not logged in as a parent
pl: Nie jesteś zalogowany jako rodzic

# Error_NotLoggedInAsTeacher
source: You are not logged in as a teacher
pl: Nie jesteś zalogowany jako nauczyciel

source: From
pl: Od

source: Grade
pl: Ocena

# Header_GradeManagement
source: Grade Management
pl: Zarządzanie Ocenami\n

source: in
pl: dla przedmiotu

source: Inbox
pl: Skrzynka odbiorcza

source: Invalid ID or password
pl: Nieprawidłowy identyfikator lub hasło

# InvalidInputInfo
source: Invalid input. Please enter a single letter (A-Z):
pl: Nieprawidłowe dane. Podaj jedną literę od A do Z:

source: Invalid login credentials
pl: Nieprawidłowe dane logowania

# InvalidLoginOrPassword
source: Invalid login or password. Returning to role selection...
pl: Nieprawidłowy login lub hasło. Powracam do wyboru roli...

source: Invalid recipient selected
pl: Wybrany odbiorca jest nieprawidłowy

# Label_Class
source: Class {0}
pl: Klasa {0}

source: Logged in as
pl: Zalogowano jako

source: Logged in as student
pl: Zalogowano jako uczeń

# Menu_AddClass
source: Add Class
pl: Dodaj klasę

# Menu_AddGrade
source: Add Grade
pl: Dodaj Ocenę

# Menu_AddParent
source: Add Parent
pl: Dodaj rodzica

# Menu_AddStudent
source: Add Student
pl: Dodaj ucznia

# Menu_AddSubject
source: Add Subject
pl: Dodaj przedmiot

# Menu_AddTeacher
source: Add Teacher
pl: Dodaj nauczyciela

# Menu_Class
source: {0}. Class {1}
pl: {0}. Klasa {1}

# Menu_ComposeMessage
source: Compose Message
pl: Napisz wiadomość

# Menu_Exit
source: Exit
pl: Wyjdź

# Menu_Inbox
source: Inbox
pl: Skrzynka odbiorcza

# Menu_ManageGrades
source: Manage Grades
pl: Zarządzaj ocenami

# Menu_SentMessages
source: Sent Messages
pl: Wysłane wiadomości

# Menu_ViewByClass
source: View by Class
pl: Przeglądaj według klasy

# Menu_ViewClasses
source: View Classes
pl: Przeglądaj klasy

# Menu_ViewPersonal
source: View Personal (Parent)
pl: Przeglądaj indywidualnie (Rodzic)

source: Message content
pl: Treść wiadomości

source: Message sent
pl: Wiadomość została wysłana

# Message_AddingGradeFor
source: Adding a grade for
pl: Dodawanie oceny dla

# Message_EnterGradeValue
source: Enter the grade value (1-6):
pl: Wprowadź ocenę (1-6):

# Message_EnterTeacherEmail
source: Enter the teacher's email:
pl: Wprowadź email nauczyciela:

# Message_EnterTeacherFirstName
source: Enter teacher's first name:
pl: Wprowadź imię nauczyciela:

# Message_EnterTeacherLastName
source: Enter teacher's last name:
pl: Wprowadź nazwisko nauczyciela:

# Message_EnterTeacherPassword
source: Enter a new password for the teacher:
pl: Wprowadź nowe hasło dla nauczyciela:

# Message_EnterTeacherPhone
source: Enter the teacher's phone number:
pl: Wprowadź numer telefonu nauczyciela:

# Message_ExitingGradeManagement
source: Exiting grade management
pl: Wychodzenie z zarządzania ocenami

# Message_GradeAddedSuccessfully
source: Grade has been added successfully
pl: Ocena została dodana pomyślnie

# Message_GradesFor
source: Grades for
pl: Oceny dla

# Message_InvalidGrade
source: Invalid grade. Please enter a value between 1 and 6:
pl: Nieprawidłowa ocena. Proszę wpisać wartość między 1 a 6:

# Message_LoginSuccess
source: Logged in successfully
pl: Zalogowano pomyślnie

# Message_NoAssignedSubjects
source: You have no assigned subjects
pl: Nie masz przypisanych przedmiotów

# Message_NoClassesAvailable
source: No classes available.
pl: Brak dostępnych klas.

# Message_NoGradesFoundFor
source: No grades found for
pl: Nie znaleziono ocen dla

# Message_NoParentsFound
source: No parents found with the given name
pl: Nie znaleziono rodziców o podanym nazwisku

# Message_NoStudentLinkedToParent
source: No student linked to this parent
pl: Brak ucznia powiązanego z tym rodzicem

# Message_NoStudentsInClass
source: No students in this class
pl: Brak uczniów w tej klasie

# Message_ParentAdded
source: Parent has been added.Parent has been added
pl: Rodzic został dodany.

# Message_ParentInfo
source: {0}. {1} {2}, Phone: {3}
pl: {0}. {1} {2}, Telefon: {3}

# Message_Read
source: [Read]
pl: [Przeczytana]

# Message_ReturnToRoleSelection
source: You chose to return to the role selection
pl: Wybrałeś powrót do wyboru roli

# Message_SelectClassToView
source: Select a class to view its students:
pl: Wybierz klasę, aby zobaczyć jej uczniów:

# Message_SelectParent
source: Select the parent using arrow keys
pl: Wybierz rodzica za pomocą klawiszy strzałek.

# Message_SelectSubject
source: Select a subject:
pl: Wybierz przedmiot:

# Message_StudentAdded
source: Student has been added
pl: Uczeń został dodany

# Message_SubjectAdded
source: Subject has been added
pl: Przedmiot został dodany.

# Message_TeacherAdded
source: Teacher has been added
pl: Nauczyciel został dodany

# Message_Unread
source: [Unread]
pl: [Nieprzeczytana]

source: No
pl: Nie

# NoClassesInfo
source: No classes available
pl: Brak dostępnych klas

source: No messages
pl: Brak wiadomości

source: No recipients found
pl: Nie znaleziono odbiorców

source: No sent messages
pl: Brak wysłanych wiadomości

# NoTeachersInfo
source: No teachers added
pl: Brak nauczycieli na liście

source: Parent
pl: Rodzic

# PressAnyKeyToGoBack
source: Press any key to go back to sent messages
pl: Naciśnij dowolny klawisz, aby wrócić do wysłanych wiadomości

# Prompt_ClassLetter
source: Enter the class letter (A-Z):
pl: Podaj literę klasy (A-Z):

# Prompt_EnterAtLeast3Letters
source: Please enter at least 3 letters of the last name:
pl: Proszę wpisać co najmniej 3 litery nazwiska:

# Prompt_EnterParentLastName
source: Enter at least 3 letters of parent's last name:
pl: Wpisz co najmniej 3 litery nazwiska rodzica:

# Prompt_EnterSubjectName
source: Enter subject's name:
pl: Wprowadź nazwę przedmiotu:

# Prompt_ParentEmail
source: Enter parent's email address:
pl: Wprowadź adres e-mail rodzica:

# Prompt_ParentFirstName
source: Enter parent's first name:
pl: Wprowadź imię rodzica:

# Prompt_ParentLastName
source: Enter parent's last name:
pl: Wprowadź nazwisko rodzica:

# Prompt_ParentPassword
source: Enter parent's password:
pl: Wprowadź hasło rodzica:

# Prompt_ParentPhoneNumber
source: Enter parent's phone number:
pl: Wprowadź numer telefonu rodzica:

# Prompt_SelectClass
source: Select a class for the student using arrow keys:
pl: Wybierz klasę używając strzałek:

# Prompt_SelectClass1
source: Select a class:
pl: Wybierz klasę:

# Prompt_SelectClassGrade
source: Select class grade (1-8):
pl: Wybierz poziom klasy (1-8):

# Prompt_SelectStudentInClass
source: Class {0}: Select a student:
pl: Klasa {0}: Wybierz ucznia:

# Prompt_SelectTeachers
source: Select teachers
pl: Wybierz nauczycieli

# Prompt_StudentBirthDate
source: Enter student's BirthDate (yyyy-mm-dd):
pl: Podaj datę urodzenia ucznia (rrrr-mm-dd):

# Prompt_StudentFirstName
source: Enter student's first name:
pl: Podaj imię ucznia:

# Prompt_StudentLastName
source: Enter student's last name:
pl: Podaj nazwisko ucznia:

# Prompt_StudentPassword
source: Enter student's password:
pl: Podaj hasło ucznia:

# Prompt_SupervisingTeacher
source: Select a supervising teacher
pl: Wybierz wychowawcę klasy

# RetryPrompt
source: Do you want to retry?
pl: Czy chcesz spróbować ponownie?

source: Selected grade:
pl: Wybrany poziom:

# SelectMessageDetails
source: Select a message to view details (Enter number):
pl: Wybierz wiadomość, aby zobaczyć szczegóły (Wprowadź numer):

# SelectRecipient
source: Select a recipient (Enter number):
pl: Wybierz odbiorcę (wprowadź numer):

# SelectRecipientType
source: Select the recipient type:
pl: Wybierz typ odbiorcy

# Select_Message_To_Read
source: Select a message to read (Enter number):
pl: Wybierz wiadomość do przeczytania (Wpisz numer):

source: Sent
pl: Wysłano

source: Sent Messages
pl: Wysłane wiadomości

source: Student
pl: Uczeń

# Students_Info
source: - students:
pl: - uczniowie:

source: Subject
pl: Przedmiot

# Subject1
source: Subject
pl: Temat

source: Teacher
pl: Nauczyciel

source: To
pl: Do

source: Yes
pl: Tak
